/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   Dog.hpp                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: seojchoi <seojchoi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/14 17:06:41 by seojchoi          #+#    #+#             */
/*   Updated: 2024/01/14 18:51:03 by seojchoi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef DOG_HPP
#define DOG_HPP
# include "Animal.hpp"

class Dog
{
public:
	Dog();
	// 복사 생성자
	// 복사 대입 연산자
	~Dog();

	void makeSound();
};

#endif
